ampersandCFD/tests/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*  This file is part of OpenFOAM.                                            *
 *                                                                            *
 *  OpenFOAM is free software: you can redistribute it and/or modify it       *
 *  under the terms of the GNU General Public License as published by the     *
 *  Free Software Foundation, either version 3 of the License, or             *
 *  (at your option) any later version.                                       *
 *                                                                            *
 *  OpenFOAM is distributed in the hope that it will be useful, but WITHOUT   *
 *  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or     *
 *  FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License     *
 *  for more details.                                                         *
 *                                                                            *
 *  You should have received a copy of the GNU General Public License         *
 *  along with OpenFOAM.  If not, see <http://www.gnu.org/licenses/>.         *
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 1 5 4)
    );
    patch outlet
    (
        (2 3 7 6)
    );
    patch bottom
    (
        (0 3 7 4)
    );
    patch top
    (
        (1 2 6 5)
    );
    patch front
    (
        (0 1 2 3)
    );
    patch back
    (
        (4 5 6 7)
    );
);

mergePatchPairs
(
);

// ************************************************************************* //
